#!/bin/bash
set -e

# usage ========================================================================
# bash ${CORE_BIN_DIR}/gpu/install_gpu_inel.sh ${CUR_USER};
# ==============================================================================


# ENV ==========================================================================
# ------------------------------------------------------------------------------
# /core/linux/bin/gpu
CUR_DIR="$(dirname "$(realpath "${BASH_SOURCE[0]}")")"

ROOT_DIR="${CUR_DIR}/../../../.."

# core/linux/bin
CORE_BIN_DIR="${ROOT_DIR}/core/linux/bin"
# ------------------------------------------------------------------------------

# ------------------------------------------------------------------------------
CUR_USER=${1};
HOME_DIR=$(eval echo ~${CUR_USER});

CUR_VER=$(cat /etc/*-release 2> /dev/null);

CUR_ARCH=$(uname -m);

CUR_WMDE=$(ls /usr/bin/*session 2> /dev/null || true);
# ------------------------------------------------------------------------------

# ------------------------------------------------------------------------------
# CPU 모델명에서 세대 정보 추출 (예: i7-8700 -> 8)
CPU_MODEL=$(grep "model name" /proc/cpuinfo | head -n 1)

INTEL_GENERATION=$(echo "$CPU_MODEL" | grep -oP 'i[3579]-\K[0-9]+(?=[0-9]{3})| \K[0-9]+(?=[0-9]{3})' | head -n 1 || true)
# ------------------------------------------------------------------------------
# ==============================================================================



# Funcs ========================================================================
function install_intel_for_pacman()
{
    # --------------------------------------------------------------------------
    # pacman -S --needed --noconfirm mesa vulkan-intel vulkan-tools intel-media-driver;
    # --------------------------------------------------------------------------

    # --------------------------------------------------------------------------
    # OpenGL
    [[ -n $(pacman -Q | grep -i ^mesa) ]] || pacman -S --needed --noconfirm mesa;
    # --------------------------------------------------------------------------

    # --------------------------------------------------------------------------
    # Vulkan
    [[ -n $(pacman -Q | grep -i ^vulkan-intel) ]] || pacman -S --needed --noconfirm vulkan-intel;
    # --------------------------------------------------------------------------

    # --------------------------------------------------------------------------
    # Vulkan tools
    [[ -n $(pacman -Q | grep -i ^vulkan-tools) ]] || pacman -S --needed --noconfirm vulkan-tools;
    # --------------------------------------------------------------------------

    # --------------------------------------------------------------------------
    # VA-API
    if [ -z "${INTEL_GENERATION}" ]; then
        return 0
    fi
    if [ "${INTEL_GENERATION}" -ge 5 ]; then
        # ----------------------------------------------------------------------
        # GPU : 5세대(Broadwell)부터는 최신 런타임이 작동합니다. (8세대부터 제대로 작동한다.)
        [[ -n $(pacman -Q | grep -i ^intel-media-driver) ]] || pacman -S --needed --noconfirm intel-media-driver;
        # ----------------------------------------------------------------------
    else
        # ----------------------------------------------------------------------
        # CPU : 3세대 이하는 미련 없이 pocl입니다.
        [[ -n $(pacman -Q | grep -i ^libva-intel-driver) ]] || pacman -S --needed --noconfirm libva-intel-driver;
        # ----------------------------------------------------------------------
    fi
    # --------------------------------------------------------------------------

    # --------------------------------------------------------------------------
    # OpenCL
    if [ -z "${INTEL_GENERATION}" ]; then
        return 0
    fi
    if [ "${INTEL_GENERATION}" -ge 5 ]; then
        # ----------------------------------------------------------------------
        # GPU : 5세대(Broadwell)부터는 최신 런타임이 작동합니다. (8세대부터 제대로 작동한다.)
        [[ -n $(pacman -Q | grep -i ^intel-compute-runtime) ]] || pacman -S --needed --noconfirm intel-compute-runtime;
        # ----------------------------------------------------------------------
    elif [ "${INTEL_GENERATION}" -eq 4 ]; then
        # ----------------------------------------------------------------------
        # GPU : 4세대(Haswell)는 특수하게 구형 엔진이나 Mesa를 시도해야 합니다.
        # 방법1)
        [[ -n $(pacman -Q | grep -i ^opencl-mesa) ]] || pacman -S --needed --noconfirm opencl-mesa;

        # 방법2)
        # [[ -n $(pacman -Q | grep -i ^intel-opencl) ]] || yay -S --needed --noconfirm intel-opencl;
        # ----------------------------------------------------------------------
    else
        # ----------------------------------------------------------------------
        # CPU : 3세대 이하는 미련 없이 pocl입니다.
        [[ -n $(pacman -Q | grep -i ^pocl) ]] || pacman -S --needed --noconfirm pocl;
        # ----------------------------------------------------------------------
    fi
    [[ -n $(pacman -Q | grep -i ^oci-icd) ]] || pacman -S --needed --noconfirm oci-icd;
    # --------------------------------------------------------------------------

    # --------------------------------------------------------------------------
    # OpenCL tools
    [[ -n $(pacman -Q | grep -i ^clinfo) ]] || pacman -S --needed --noconfirm clinfo;
    # --------------------------------------------------------------------------
}


function install_intel_for_apt()
{
    # --------------------------------------------------------------------------
    # apt install -y libgl1-mesa-dri mesa-vulkan-drivers vulkan-tools intel-media-va-driver;
    # --------------------------------------------------------------------------

    # --------------------------------------------------------------------------
    # OpenGL
    [[ -n $(apt list --installed | grep -i ^libgl1-mesa-dri) ]] || apt install -y libgl1-mesa-dri;
    # --------------------------------------------------------------------------

    # --------------------------------------------------------------------------
    # Vulkan
    [[ -n $(apt list --installed | grep -i ^mesa-vulkan-drivers) ]] || apt install -y mesa-vulkan-drivers;
    # --------------------------------------------------------------------------

    # --------------------------------------------------------------------------
    # Vulkan tools
    [[ -n $(apt list --installed | grep -i ^vulkan-tools) ]] || apt install -y vulkan-tools;
    # --------------------------------------------------------------------------

    # --------------------------------------------------------------------------
    # VA-API
    [[ -n $(apt list --installed | grep -i ^intel-media-va-driver) ]] || apt install -y intel-media-va-driver;
    # --------------------------------------------------------------------------

    # --------------------------------------------------------------------------
    # OpenCL
    if [ -z "${INTEL_GENERATION}" ]; then
        return 0
    fi
    if [ "${INTEL_GENERATION}" -ge 5 ]; then
        # ----------------------------------------------------------------------
        # GPU : 5세대(Broadwell)부터는 최신 런타임이 작동합니다. (8세대부터 제대로 작동한다.)
        [[ -n $(apt list --installed | grep -i ^mesa-opencl-icd) ]] || apt install -y mesa-opencl-icd;
        # ----------------------------------------------------------------------
    elif [ "${INTEL_GENERATION}" -eq 4 ]; then
        # ----------------------------------------------------------------------
        # GPU : 4세대(Haswell)는 특수하게 구형 엔진이나 Mesa를 시도해야 합니다.
        [[ -n $(apt list --installed | grep -i ^mesa-opencl-icd) ]] || apt install -y mesa-opencl-icd;
        # ----------------------------------------------------------------------
    else
        # ----------------------------------------------------------------------
        # CPU : 3세대 이하는 미련 없이 pocl입니다.
        [[ -n $(apt list --installed | grep -i ^pocl-opencl-icd) ]] || apt install -y pocl-opencl-icd;
        # ----------------------------------------------------------------------
    fi
    [[ -n $(apt list --installed | grep -i ^ocl-icd-libopencl1) ]] || apt install -y ocl-icd-libopencl1;
    # --------------------------------------------------------------------------

    # --------------------------------------------------------------------------
    # OpenCL tools
    [[ -n $(apt list --installed | grep -i ^clinfo) ]] || apt install -y clinfo;
    # --------------------------------------------------------------------------
}


function install_intel_for_dnf()
{
    # --------------------------------------------------------------------------
    # dnf install -y mesa-dri-drivers mesa-vulkan-drivers vulkan-tools intel-media-driver;
    # --------------------------------------------------------------------------

    # --------------------------------------------------------------------------
    # OpenGL
    [[ -n $(dnf list --installed | grep -i ^mesa-dri-drivers) ]] || dnf install -y mesa-dri-drivers;
    # --------------------------------------------------------------------------

    # --------------------------------------------------------------------------
    # Vulkan
    [[ -n $(dnf list --installed | grep -i ^mesa-vulkan-drivers) ]] || dnf install -y mesa-vulkan-drivers;
    # --------------------------------------------------------------------------

    # --------------------------------------------------------------------------
    # Vulkan tools
    [[ -n $(dnf list --installed | grep -i ^vulkan-tools) ]] || dnf install -y vulkan-tools;
    # --------------------------------------------------------------------------

    # --------------------------------------------------------------------------
    # VA-API
    [[ -n $(dnf list --installed | grep -i ^intel-media-driver) ]] || dnf install -y intel-media-driver;
    # --------------------------------------------------------------------------

    # --------------------------------------------------------------------------
    # OpenCL
    if [ -z "${INTEL_GENERATION}" ]; then
        return 0
    fi
    if [ "${INTEL_GENERATION}" -ge 5 ]; then
        # ----------------------------------------------------------------------
        # GPU : 5세대(Broadwell)부터는 최신 런타임이 작동합니다. (8세대부터 제대로 작동한다.)
        [[ -n $(dnf list --installed | grep -i ^intel-compute-runtime) ]] || dnf install -y intel-compute-runtime;
        # ----------------------------------------------------------------------
    elif [ "${INTEL_GENERATION}" -eq 4 ]; then
        # ----------------------------------------------------------------------
        # GPU : 4세대(Haswell)는 특수하게 구형 엔진이나 Mesa를 시도해야 합니다.
        [[ -n $(dnf list --installed | grep -i ^mesa-libOpenCL) ]] || dnf install -y mesa-libOpenCL;
        # ----------------------------------------------------------------------
    else
        # ----------------------------------------------------------------------
        # CPU : 3세대 이하는 미련 없이 pocl입니다.
        [[ -n $(dnf list --installed | grep -i ^pocl) ]] || dnf install -y pocl;
        # ----------------------------------------------------------------------
    fi
    [[ -n $(dnf list --installed | grep -i ^ocl-icd) ]] || dnf install -y ocl-icd;
    # --------------------------------------------------------------------------

    # --------------------------------------------------------------------------
    # OpenCL tools
    [[ -n $(dnf list --installed | grep -i ^clinfo) ]] || dnf install -y clinfo;
    # --------------------------------------------------------------------------
}


function execute_main()
{
    # --------------------------------------------------------------------------
    # debian(non-free, restricted) is needed for nvidia
    # fedora(rmpfusion) is needed for nvidia
    bash ${CORE_BIN_DIR}/pkgmgmt/update_repo.sh;
    # --------------------------------------------------------------------------

    # --------------------------------------------------------------------------
    if [[ "${CUR_VER}" == *"archlinux"* ]]; then
        # ----------------------------------------------------------------------
        install_intel_for_pacman
        # ----------------------------------------------------------------------

    elif [[ "${CUR_VER}" == *"debian.org"* ]] || [[ "${CUR_VER}" == *"ubuntu"* ]]; then
        # ----------------------------------------------------------------------
        install_intel_for_apt;
        # ----------------------------------------------------------------------

    elif [[ "${CUR_VER}" == *"Fedora"* ]] || [[ "${CUR_VER}" == *"CentOS"* ]] || [[ "${CUR_VER}" == *"rocky"* ]]; then
        # ----------------------------------------------------------------------
        install_intel_for_dnf;
        # ----------------------------------------------------------------------
    fi
    # --------------------------------------------------------------------------
}
# ==============================================================================


# Main =========================================================================
if [[ "${BASH_SOURCE[0]}" == "${0}" ]]; then
    execute_main;

    source ${CORE_BIN_DIR}/pkgmgmt/install_pkgmgmt_funcs.sh && show_msg "";
fi
# ==============================================================================